read_verilog cpu.v alu.v load_store.v branch.v regfile.v decoder.v 
synth_xilinx -top cpu
write_verilog cpu_synth.v

